veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEdsadc_bf.h
/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN22 */
#define IFX_EDSADC_ACCEN0_EN22_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN22 */
#define IFX_EDSADC_ACCEN0_EN22_OFF (22u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN23 */
#define IFX_EDSADC_ACCEN0_EN23_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN23 */
#define IFX_EDSADC_ACCEN0_EN23_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN23 */
#define IFX_EDSADC_ACCEN0_EN23_OFF (23u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN24 */
#define IFX_EDSADC_ACCEN0_EN24_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN24 */
#define IFX_EDSADC_ACCEN0_EN24_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN24 */
#define IFX_EDSADC_ACCEN0_EN24_OFF (24u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN25 */
#define IFX_EDSADC_ACCEN0_EN25_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN25 */
#define IFX_EDSADC_ACCEN0_EN25_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN25 */
#define IFX_EDSADC_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN26 */
#define IFX_EDSADC_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN26 */
#define IFX_EDSADC_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN26 */
#define IFX_EDSADC_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN27 */
#define IFX_EDSADC_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN27 */
#define IFX_EDSADC_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN27 */
#define IFX_EDSADC_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN28 */
#define IFX_EDSADC_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN28 */
#define IFX_EDSADC_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN28 */
#define IFX_EDSADC_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN29 */
#define IFX_EDSADC_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN29 */
#define IFX_EDSADC_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN29 */
#define IFX_EDSADC_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN30 */
#define IFX_EDSADC_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN30 */
#define IFX_EDSADC_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN30 */
#define IFX_EDSADC_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN31 */
#define IFX_EDSADC_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN31 */
#define IFX_EDSADC_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN31 */
#define IFX_EDSADC_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.DITRIM */
#define IFX_EDSADC_GLOBCFG_DITRIM_LEN (3u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.DITRIM */
#define IFX_EDSADC_GLOBCFG_DITRIM_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.DITRIM */
#define IFX_EDSADC_GLOBCFG_DITRIM_OFF (8u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.USC */
#define IFX_EDSADC_GLOBCFG_USC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.USC */
#define IFX_EDSADC_GLOBCFG_USC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.USC */
#define IFX_EDSADC_GLOBCFG_USC_OFF (12u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EDSADC_GLOBCFG_SUPLEV_LEN (2u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EDSADC_GLOBCFG_SUPLEV_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EDSADC_GLOBCFG_SUPLEV_OFF (13u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.CPWC */
#define IFX_EDSADC_GLOBCFG_CPWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.CPWC */
#define IFX_EDSADC_GLOBCFG_CPWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.CPWC */
#define IFX_EDSADC_GLOBCFG_CPWC_OFF (15u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.SVCH */
#define IFX_EDSADC_GLOBCFG_SVCH_LEN (4u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.SVCH */
#define IFX_EDSADC_GLOBCFG_SVCH_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.SVCH */
#define IFX_EDSADC_GLOBCFG_SVCH_OFF (24u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.SVSIG */
#define IFX_EDSADC_GLOBCFG_SVSIG_LEN (2u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.SVSIG */
#define IFX_EDSADC_GLOBCFG_SVSIG_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.SVSIG */
#define IFX_EDSADC_GLOBCFG_SVSIG_OFF (28u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.SVWC */
#define IFX_EDSADC_GLOBCFG_SVWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.SVWC */
#define IFX_EDSADC_GLOBCFG_SVWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.SVWC */
#define IFX_EDSADC_GLOBCFG_SVWC_OFF (31u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH0RUN */
#define IFX_EDSADC_GLOBRC_CH0RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH0RUN */
#define IFX_EDSADC_GLOBRC_CH0RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH0RUN */
#define IFX_EDSADC_GLOBRC_CH0RUN_OFF (0u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH1RUN */
#define IFX_EDSADC_GLOBRC_CH1RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH1RUN */
#define IFX_EDSADC_GLOBRC_CH1RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH1RUN */
#define IFX_EDSADC_GLOBRC_CH1RUN_OFF (1u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH2RUN */
#define IFX_EDSADC_GLOBRC_CH2RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH2RUN */
#define IFX_EDSADC_GLOBRC_CH2RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH2RUN */
#define IFX_EDSADC_GLOBRC_CH2RUN_OFF (2u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH3RUN */
#define IFX_EDSADC_GLOBRC_CH3RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH3RUN */
#define IFX_EDSADC_GLOBRC_CH3RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH3RUN */
#define IFX_EDSADC_GLOBRC_CH3RUN_OFF (3u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH4RUN */
#define IFX_EDSADC_GLOBRC_CH4RUN_LEN (1u)

