veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEdsadc_bf.h
/** \brief Mask for Ifx_EDSADC_CH_ISTAT_Bits.REPCNT */
#define IFX_EDSADC_CH_ISTAT_REPCNT_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_CH_ISTAT_Bits.REPCNT */
#define IFX_EDSADC_CH_ISTAT_REPCNT_OFF (8u)

/** \brief Length for Ifx_EDSADC_CH_ISTAT_Bits.INTEN */
#define IFX_EDSADC_CH_ISTAT_INTEN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_ISTAT_Bits.INTEN */
#define IFX_EDSADC_CH_ISTAT_INTEN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_ISTAT_Bits.INTEN */
#define IFX_EDSADC_CH_ISTAT_INTEN_OFF (15u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.SRLVL */
#define IFX_EDSADC_CH_RFC_SRLVL_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.SRLVL */
#define IFX_EDSADC_CH_RFC_SRLVL_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.SRLVL */
#define IFX_EDSADC_CH_RFC_SRLVL_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.RDEC */
#define IFX_EDSADC_CH_RFC_RDEC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.RDEC */
#define IFX_EDSADC_CH_RFC_RDEC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.RDEC */
#define IFX_EDSADC_CH_RFC_RDEC_OFF (4u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.WREC */
#define IFX_EDSADC_CH_RFC_WREC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.WREC */
#define IFX_EDSADC_CH_RFC_WREC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.WREC */
#define IFX_EDSADC_CH_RFC_WREC_OFF (5u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.FIFL */
#define IFX_EDSADC_CH_RFC_FIFL_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.FIFL */
#define IFX_EDSADC_CH_RFC_FIFL_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.FIFL */
#define IFX_EDSADC_CH_RFC_FIFL_OFF (6u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.FILL */
#define IFX_EDSADC_CH_RFC_FILL_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.FILL */
#define IFX_EDSADC_CH_RFC_FILL_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.FILL */
#define IFX_EDSADC_CH_RFC_FILL_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.RDERR */
#define IFX_EDSADC_CH_RFC_RDERR_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.RDERR */
#define IFX_EDSADC_CH_RFC_RDERR_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.RDERR */
#define IFX_EDSADC_CH_RFC_RDERR_OFF (20u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.WRERR */
#define IFX_EDSADC_CH_RFC_WRERR_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.WRERR */
#define IFX_EDSADC_CH_RFC_WRERR_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.WRERR */
#define IFX_EDSADC_CH_RFC_WRERR_OFF (21u)

/** \brief Length for Ifx_EDSADC_CH_RESM_Bits.RESULTLO */
#define IFX_EDSADC_CH_RESM_RESULTLO_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_RESM_Bits.RESULTLO */
#define IFX_EDSADC_CH_RESM_RESULTLO_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_RESM_Bits.RESULTLO */
#define IFX_EDSADC_CH_RESM_RESULTLO_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_RESM_Bits.RESULTHI */
#define IFX_EDSADC_CH_RESM_RESULTHI_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_RESM_Bits.RESULTHI */
#define IFX_EDSADC_CH_RESM_RESULTHI_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_RESM_Bits.RESULTHI */
#define IFX_EDSADC_CH_RESM_RESULTHI_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_OFFCOMP_Bits.OFFSET */
#define IFX_EDSADC_CH_OFFCOMP_OFFSET_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_OFFCOMP_Bits.OFFSET */
#define IFX_EDSADC_CH_OFFCOMP_OFFSET_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_OFFCOMP_Bits.OFFSET */
#define IFX_EDSADC_CH_OFFCOMP_OFFSET_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_GAINCAL_Bits.CALFACTOR */
#define IFX_EDSADC_CH_GAINCAL_CALFACTOR_LEN (13u)

/** \brief Mask for Ifx_EDSADC_CH_GAINCAL_Bits.CALFACTOR */
#define IFX_EDSADC_CH_GAINCAL_CALFACTOR_MSK (0x1fffu)

/** \brief Offset for Ifx_EDSADC_CH_GAINCAL_Bits.CALFACTOR */
#define IFX_EDSADC_CH_GAINCAL_CALFACTOR_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_GAINCAL_Bits.CALTARGET */
#define IFX_EDSADC_CH_GAINCAL_CALTARGET_LEN (15u)

/** \brief Mask for Ifx_EDSADC_CH_GAINCAL_Bits.CALTARGET */
#define IFX_EDSADC_CH_GAINCAL_CALTARGET_MSK (0x7fffu)

/** \brief Offset for Ifx_EDSADC_CH_GAINCAL_Bits.CALTARGET */
#define IFX_EDSADC_CH_GAINCAL_CALTARGET_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_GAINCTR_Bits.GAINFACTOR */
#define IFX_EDSADC_CH_GAINCTR_GAINFACTOR_LEN (13u)

/** \brief Mask for Ifx_EDSADC_CH_GAINCTR_Bits.GAINFACTOR */
#define IFX_EDSADC_CH_GAINCTR_GAINFACTOR_MSK (0x1fffu)

/** \brief Offset for Ifx_EDSADC_CH_GAINCTR_Bits.GAINFACTOR */
#define IFX_EDSADC_CH_GAINCTR_GAINFACTOR_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_GAINCTR_Bits.CICSHIFT */
#define IFX_EDSADC_CH_GAINCTR_CICSHIFT_LEN (5u)

/** \brief Mask for Ifx_EDSADC_CH_GAINCTR_Bits.CICSHIFT */
#define IFX_EDSADC_CH_GAINCTR_CICSHIFT_MSK (0x1fu)

/** \brief Offset for Ifx_EDSADC_CH_GAINCTR_Bits.CICSHIFT */
#define IFX_EDSADC_CH_GAINCTR_CICSHIFT_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_GAINCTR_Bits.CICDEC */
#define IFX_EDSADC_CH_GAINCTR_CICDEC_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_GAINCTR_Bits.CICDEC */
#define IFX_EDSADC_CH_GAINCTR_CICDEC_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_GAINCTR_Bits.CICDEC */
#define IFX_EDSADC_CH_GAINCTR_CICDEC_OFF (24u)

/** \brief Length for Ifx_EDSADC_CH_GAINCORR_Bits.GAINFACTOR */
#define IFX_EDSADC_CH_GAINCORR_GAINFACTOR_LEN (13u)

/** \brief Mask for Ifx_EDSADC_CH_GAINCORR_Bits.GAINFACTOR */
#define IFX_EDSADC_CH_GAINCORR_GAINFACTOR_MSK (0x1fffu)

/** \brief Offset for Ifx_EDSADC_CH_GAINCORR_Bits.GAINFACTOR */
#define IFX_EDSADC_CH_GAINCORR_GAINFACTOR_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_GAINCORR_Bits.CICSHIFT */
#define IFX_EDSADC_CH_GAINCORR_CICSHIFT_LEN (5u)

/** \brief Mask for Ifx_EDSADC_CH_GAINCORR_Bits.CICSHIFT */
#define IFX_EDSADC_CH_GAINCORR_CICSHIFT_MSK (0x1fu)

/** \brief Offset for Ifx_EDSADC_CH_GAINCORR_Bits.CICSHIFT */
#define IFX_EDSADC_CH_GAINCORR_CICSHIFT_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_TSTMP_Bits.TIMESTAMP */
#define IFX_EDSADC_CH_TSTMP_TIMESTAMP_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_TSTMP_Bits.TIMESTAMP */
#define IFX_EDSADC_CH_TSTMP_TIMESTAMP_MSK (0xffffu)

